import {IAxios} from '../hooks/useFetch';

export const errMessageMap: Record<number, string> = {
  0: '操作失败',
  1: '操作成功',
  1002: '用户不存在',
  1003: '密码不正确',
  1004: '记录不存在',
  1007: '获取主机头失败',
  1008: '主机头为空',
  1009: '主机头不合法',
  1010: '获取认证信息失败',
  1011: '请求不合法，不存在认证信息',
  1012: '请求不合法，认证失败',
  1013: '请求不合法',
  1014: '参数错误',
  1015: '名称已存在',
  1016: '管理账号已存在',
  1017: '编码已存在',
  1018: '基础配置错误',
  1025: '版本号已存在',
  50033: '数据元素值不存在!',
  50034: '请输入用户账号',
  50035: '请输入密码',
  50036: 'LDAP认证失败',
  50049: '当前App没有绑定设备',
  50048: '当前机台已经绑定APP',
  50047: '当前APP已经绑定机台',

  100000: 'MES Exception: -0-',
  100001: 'EAP Exception: -0-',
  100002: '当前材料编码-0-规则不正确',
  100003: '请返回主页面，重新操作',
  100004: '条码-0-和当前批次信息不符合，条码错误',
  100005: '条码-0-不能重复扫描，条码错误',
  100006: '上次使用工单是-0-，您确定更换工单吗？',
  100007: '系统不存在当前设备-0-',
  100008: '系统不存在工单-0-的信息',
  100009: '料盒信息对比不完整，请对比所有料盒信息',
  100010: '添加材料信息失败',
  100011: '当前工单没有绑定物料信息，请先绑定物料',
  100012: 'MES中没有维护料盒信息',
  100013: '当前机台还未开批',
  100014: '当前机台和工单已开批',
  100015: '机台周保养到期，请先做PM',
  100016: '机台月保养到期，请先做PM',
  100017: '机台双月保养到期，请先做PM',
  100018: '机台季度保养到期，请先做PM',
  100019: '机台半年保养到期，请先做PM',
  100020: '机台年保养到期，请先做PM',
  100021: '请把数据填写完整',
  100022: '操作失败:-0-',
  100023: '状态不能为空',
  100024: '原因代码不能为空',
  100025: '作业批号不能为空',
  100026: '键合头不能重复',
  100027: 'MES给到的料盒信息为空',
  100034: '当前批次使用机台是-0-',
  100035: '不同类型的材料或者耗材，不能使用相同的条码',
  10084: '该产线层级报警代码已配置',
  10085: '该产线层级警代码重复',
  100028: '作业数量不能大于批次总数',
  100029: '废品数量不能大于批次总数',
  100030: '废品总数不能大于批次总数',
  100031: '次品数量不能大于批次总数',
  100032: '次品总数不能大于批次总数',
  100033: '当前机台使用作业批号是-0-',
  999999: '系统未知异常',
};

export const ToastMessage = (res: IAxios): string => {
  const errM = errMessageMap[res.message];
  const regArr = errM.match(/-[0-9]-/g);
  let newErrMessage = errM;
  if (regArr && res.data.length) {
    for (let i = 0; i < regArr.length; i++) {
      newErrMessage = newErrMessage.replace(
        new RegExp(regArr[i], 'g'),
        res.data[i],
      );
    }
    return newErrMessage;
  } else {
    return errM;
  }
};
